{
    "Details":[
        {
            "Name":"A.P.J. Abdul Kalam",
            "Image":"https://cdn.britannica.com/48/222648-050-F4D0A2D8/President-of-India-A-P-J-Abdul-Kalam-2007.jpg",
            "Details":"Avul Pakir Jainulabdeen Abdul Kalam  15 October 193127 July 2015) was an Indian aerospace scientist and statesman who served as the president of India from 2002 to 2007.Born and raised in a Muslim family in Rameswaram, Tamil Nadu, he studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts. He was known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the second test since the first nuclear test by India in 1974.Kalam was elected as the president of India in 2002 with the support of both the ruling Bharatiya Janata Party and the then-opposition Indian National Congress. He was widely referred to as the People's President. He engaged in teaching, writing and public service after his presidency. He was a recipient of several awards, including the Bharat Ratna, India's highest civilian honour.After graduating from the Madras Institute of Technology in 1960, Kalam became a member of the Defence Research & Development Service and joined the Aeronautical Development Establishment of the Defence Research and Development Organisation (DRDO) as a scientist. During his early career, he was involved in the design of small hovercraft, and remained unconvinced by his choice of a job at DRDO.[19] Later, he joined the Indian National Committee for Space Research, working under renowned space scientist Vikram Sarabhai.[3] He was interviewed and recruited into Indian Space Research Organisation (ISRO) by H. G. S. Murthy, the first director of the Thumba Equatorial Rocket Launching Station.[20]In 1969, Kalam transferred to ISRO where he became the project director of India's first satellite launch vehicle (SLV) which successfully deployed the Rohini satellite in near-earth orbit in July 1980. He had earlier started work on an expandable rocket project independently at DRDO in 1965.[21] In 1969, Kalam received the approval from the Government of India to expand the programme to include more engineers.[18] In 1963–64, he visited NASA's Langley Research Center in Hampton, Goddard Space Flight Center in Greenbelt, and Wallops Flight Facility.[2][22] Since the late 1970s, Kalam was part of the effort to develop the SLV-3 and Polar Satellite Launch Vehicle (PSLV), both of which were successful.[23][24]In May 1974, Kalam was invited by Raja Ramanna to witness the country's first nuclear test Smiling Buddha as the representative of Terminal Ballistics Research Laboratory, even though he was officially not part of the project.[25] In the 1970s, Kalam directed two projects, Project Devil and Project Valiant, which sought to develop ballistic missiles using the technology from the successful SLV programme. Despite the disapproval of the union cabinet, then Prime Minister Indira Gandhi allotted funds for these aerospace projects under Kalam's directorship through her discretionary powers. Kalam also played a major role in convincing the cabinet to conceal the true nature of these classified projects. His research and leadership brought him recognition in the 1980s, which prompted the government to initiate an advanced missile programme under his directorship.[26]Kalam worked with metallurgist V. S. R. Arunachalam, who was then scientific adviser to the Defence Minister, on the suggestion by the then Defence Minister R. Venkataraman on the simultaneous development of a quiver of missiles instead of taking planned missiles one after another.[27] Venkatraman was instrumental in getting the cabinet approval for allocating ₹3.88 billion (equivalent to ₹66 billion or US$750 million in 2023) for the project titled Integrated Guided Missile Development Programme (IGMDP) and appointed Kalam as its chief executive.[27] Kalam played a major role in the development of missiles including Agni, an intermediate range ballistic missile and Prithvi, the tactical surface-to-surface missile, despite inflated costs and time overruns.[27][28] He was known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology.[29][30][31]Kalam served as the chief scientific adviser to the prime minister and secretary of the DRDO from July 1992 to December 1999. He played a key organisational, political and technical role in the Pokhran-II nuclear tests conducted in May 1998.[32] Along with Rajagopala Chidambaram, he served as the chief project coordinator for the tests.[2][33] Media coverage of Kalam during this period made him the country's best known nuclear scientist.[34] However, the director of the site test, K. Santhanam, said that the thermonuclear bomb had been a fizzle and criticised Kalam for issuing an incorrect report.[35] The claim was refuted and rejected by Kalam and Chidambaram.[36]In 1998, Kalam worked with cardiologist Bhupathiraju Somaraju and developed a low cost coronary stent, named the Kalam-Raju stent.[37][38] In 2012, the duo designed a tablet computer named the Kalam-Raju tablet for usage by healthcare workers in rural areas."
        },
        {
            "Name":"Subash chandra bose",
            "Image":"https://m.media-amazon.com/images/I/41fsKL2gguL.jpg",
            "Details":"Subhas Chandra Bose (23 January 1897  18 August 1945) was an Indian nationalist whose defiant patriotism made him a hero in India, but whose attempt during World War II to rid India of British rule"
        },
        {
            "Name":"Jawaharlal Nehru",
            "Image":"https://english.cdn.zeenews.com/sites/default/files/styles/zm_700x400/public/2023/12/12/1334920-nehru-2.png",
            "Details":"Jawaharlal Nehru (14 November 1889  27 May 1964) was an Indian anti-colonial nationalist, secular humanist, social democrat,[2] and statesman who was a central figure in India during the middle of the 20th century. Nehru was a principal leader of the Indian nationalist movement in the 1930s and 1940s. Upon India's independence in 1947, he served as the country's first prime minister for 16 years.[3] Nehru promoted parliamentary democracy, secularism, and science and technology during the 1950s, powerfully influencing India's arc as a modern nation. In international affairs, he steered India clear of the two blocs of the Cold War. A well-regarded author, he wrote books such as Letters from a Father to His Daughter (1929), An Autobiography (1936) and The Discovery of India (1946), that have been read around the world.The son of Motilal Nehru, a prominent lawyer and Indian nationalist, Jawaharlal Nehru was educated in England—at Harrow School and Trinity College, Cambridge, and trained in the law at the Inner Temple. He became a barrister, returned to India, enrolled at the Allahabad High Court and gradually became interested in national politics, which eventually became a full-time occupation. He joined the Indian National Congress, rose to become the leader of a progressive faction during the 1920s, and eventually of the Congress, receiving the support of Mahatma Gandhi, who was to designate Nehru as his political heir. As Congress president in 1929, Nehru called for complete independence from the British Raj.Nehru and the Congress dominated Indian politics during the 1930s. Nehru promoted the idea of the secular nation-state in the 1937 provincial elections, allowing the Congress to sweep the elections and form governments in several provinces. In September 1939, the Congress ministries resigned to protest Viceroy Lord Linlithgow's decision to join the war without consulting them. After the All India Congress Committee's Quit India Resolution of 8 August 1942, senior Congress leaders were imprisoned, and for a time, the organisation was suppressed. Nehru, who had reluctantly heeded Gandhi's call for immediate independence, and had desired instead to support the Allied war effort during World War II, came out of a lengthy prison term to a much altered political landscape. Under Muhammad Ali Jinnah, the Muslim League had come to dominate Muslim politics in the interim. In the 1946 provincial elections, Congress won the elections, but the League won all the seats reserved for Muslims, which the British interpreted as a clear mandate for Pakistan in some form. Nehru became the interim prime minister of India in September 1946 and the League joined his government with some hesitancy in October 1946.Upon India's independence on 15 August 1947, Nehru gave a critically acclaimed speech, Tryst with Destiny; he was sworn in as the Dominion of India's prime minister and raised the Indian flag at the Red Fort in Delhi. On 26 January 1950, when India became a republic within the Commonwealth of Nations, Nehru became the Republic of India's first prime minister. He embarked on an ambitious economic, social, and political reform programme. Nehru promoted a pluralistic multi-party democracy. In foreign affairs, he led the establishment the Non-Aligned Movement, a group of nations that did not seek membership in the two main ideological blocs of the Cold War. Under Nehru's leadership, the Congress dominated national and state-level politics and won elections in 1951, 1957 and 1962. He died in office from a heart attack in 1964. His birthday is celebrated as Children's Day in India."
        },
        {
            "Name":"Sardar Vallabhbhai Patel",
            "Image":"https://res.cloudinary.com/dkplc2mbj/image/upload/v1609410448/SVBP_7c12f687f8.jpg",
            "Details":"Vallabhbhai Jhaverbhai Patel (31 October 1875  15 December 1950), popularly known as Sardar Patel, was an Indian statesman. He served as the first Deputy Prime Minister of India. He was an Indian barrister, and a senior leader of the Indian National Congress who played a leading role in the country's struggle for independence and guided its integration into a united, independent nation. In India and elsewhere, he was often addressed as Sardar, which means Chief in Hindi, Urdu, and Persian. He acted as Home Minister during the political integration of India and the Indo-Pakistani War of 1947.Patel was born in Nadiad, British India. He was a successful lawyer. He subsequently organised peasants from Kheda, Borsad, and Bardoli in Gujarat in non-violent civil disobedience against the British Raj, becoming one of the most influential leaders in Gujarat. He rose to the leadership of the Indian National Congress and was at the forefront of rebellions and political events, organising the party for elections in 1934 and 1937, and promoting the Quit India Movement.Patel took charge of the task to forge a united India from the 565 semi-autonomous princely states and British-era colonial provinces. Using frank diplomacy backed with the option (and the use) of military action, Patel's leadership enabled the accession of almost every princely state. Hailed as"
        },
        {
            "Name":"Bhagat Singh",
            "Image":"https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2019/12/06/Pictures/_71184200-1817-11ea-ba57-c3a9d68be36c.jpg",
            "Details":"Bhagat Singh (Punjabi pronunciation: (listen) 28 September 1907  23 March 1931) was an"
        },
        {
            "Name":"Rani Laxmi Bai",
            "Image":"https://rishihood.edu.in/wp-content/uploads/2020/11/rani-scaled-2.jpg",
            "Details":"Rani Lakshmibai (pronunciation (helpinfo); 19 November 1828  18 June 1858), born Manikarnika Tambe and known popularly as Jhansi Ki Rani, was the queen of the princely state of Jhansi in North India currently present in Jhansi district in Uttar Pradesh, India. She was one of the leading figures of the Indian Rebellion of 1857 and became a symbol of resistance to the British Raj for Indian nationalists. She was born to a Marathi Karhade Brahmin family at Kashi (now Varanasi) and was married to the Maharaja of Jhansi, Raja Gangadhar Newalkar, in 1842, and became the queen of Jhansi"
        }
    ]
}